> There is a suspected freebie mentioned in the issue description. Please tend to that.

Confirmed the update to Terraform resolved issue #5656 and allowed a private API deployment without errorr.

<details>
<summary>`make deploy` log with TF 1.6.5 and private API</summary>

```
(.venv) daniel@Crispin ~/repo/azul2 $ tfenv list
* 1.6.5 (set by /Users/daniel/repo/azul2/.terraform-version)
  1.3.10
  1.3.4
  0.12.31
(.venv) daniel@Crispin ~/repo/azul2 $
(.venv) daniel@Crispin ~/repo/azul2 $ env | grep PRIVATE_API=
AZUL_PRIVATE_API=1
(.venv) daniel@Crispin ~/repo/azul2 $
(.venv) daniel@Crispin ~/repo/azul2 $ make deploy
/Library/Developer/CommandLineTools/usr/bin/make -C lambdas
/Library/Developer/CommandLineTools/usr/bin/make -C layer layer
python /Users/daniel/repo/azul2/scripts/check_branch.py
python .chalice/config.json.template.py .chalice/config.json
Creating .chalice/config.json
python /Users/daniel/repo/azul2/scripts/stage_layer.py
2024-01-11 14:55:56,549    INFO MainThread botocore.credentials: Found credentials in shared credentials file: ~/.aws/credentials
2024-01-11 14:55:57,156    INFO MainThread azul.lambda_layer: Checking for dependencies layer package at s3://edu-ucsc-gi-platform-hca-dev-shared.us-east-1/azul/daniel2/lambda_layers/23940d1fcb83c5f1f3729e5d04934aeec4a629bd.zip.
2024-01-11 14:55:57,335    INFO MainThread azul.boto3: s3.HeadObject:	Making HEAD request to https://s3.amazonaws.com/edu-ucsc-gi-platform-hca-dev-shared.us-east-1/azul/daniel2/lambda_layers/23940d1fcb83c5f1f3729e5d04934aeec4a629bd.zip
2024-01-11 14:55:57,335    INFO MainThread azul.boto3: s3.HeadObject:	… without request body
2024-01-11 14:55:57,766    INFO MainThread azul.boto3: s3.HeadObject:	Got 200 response
2024-01-11 14:55:57,766    INFO MainThread azul.boto3: s3.HeadObject:	… with response body b''
2024-01-11 14:55:57,767    INFO MainThread azul.lambda_layer: Layer package already up-to-date.
/Library/Developer/CommandLineTools/usr/bin/make -C indexer package
python /Users/daniel/repo/azul2/scripts/check_branch.py
python .chalice/config.json.template.py .chalice/config.json
[INFO]	2024-01-11T14:56:01.854Z	00010ca1-b0ba-466f-8c58-dabbad000000	botocore.credentials	Found credentials in shared credentials file: ~/.aws/credentials
Creating .chalice/config.json
python vendor/resources/environ.json.template.py vendor/resources/environ.json
Creating vendor/resources/environ.json
PYTHONHASHSEED=0 python -m compileall \
		-f -q --invalidation-mode checked-hash \
		vendor vendor/humancellatlas vendor/azul
python -m azul.changelog vendor
chalice package --stage daniel2 --pkg-format terraform .chalice/terraform
/Users/daniel/repo/azul2/.venv/lib/python3.11/site-packages/_distutils_hack/__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")
[INFO]	2024-01-11T14:56:05.257Z	00010ca1-b0ba-466f-8c58-dabbad000000	botocore.credentials	Found credentials in shared credentials file: ~/.aws/credentials
Creating deployment package.
Reusing existing deployment package.
[INFO]	2024-01-11T14:56:05.805Z	00010ca1-b0ba-466f-8c58-dabbad000000	botocore.credentials	Found credentials in environment variables.
/Library/Developer/CommandLineTools/usr/bin/make -C service package
python /Users/daniel/repo/azul2/scripts/check_branch.py
python .chalice/config.json.template.py .chalice/config.json
[INFO]	2024-01-11T14:56:10.195Z	00010ca1-b0ba-466f-8c58-dabbad000000	botocore.credentials	Found credentials in shared credentials file: ~/.aws/credentials
Creating .chalice/config.json
python vendor/resources/environ.json.template.py vendor/resources/environ.json
Creating vendor/resources/environ.json
PYTHONHASHSEED=0 python -m compileall \
		-f -q --invalidation-mode checked-hash \
		vendor vendor/humancellatlas vendor/azul
python -m azul.changelog vendor
chalice package --stage daniel2 --pkg-format terraform .chalice/terraform
/Users/daniel/repo/azul2/.venv/lib/python3.11/site-packages/_distutils_hack/__init__.py:33: UserWarning: Setuptools is replacing distutils.
  warnings.warn("Setuptools is replacing distutils.")
Creating deployment package.
Reusing existing deployment package.
[INFO]	2024-01-11T14:56:13.861Z	00010ca1-b0ba-466f-8c58-dabbad000000	botocore.credentials	Found credentials in environment variables.
/Library/Developer/CommandLineTools/usr/bin/make -C terraform apply
set -o pipefail && git ls-files --ignored --others --directory --exclude-standard | (grep -v '/[^/]' || test $? -eq 1) | xargs -r rm -rv
api_gateway.tf.json
authentication.tf.json
backend.tf.json
cloudwatch.tf.json
common.tf.json
dynamo.tf.json
lambda_layer.tf.json
providers.tf.json
s3.tf.json
sqs.tf.json
step_function.tf.json
python /Users/daniel/repo/azul2/scripts/check_branch.py
python providers.tf.json.template.py providers.tf.json
Creating providers.tf.json
python backend.tf.json.template.py backend.tf.json
Creating backend.tf.json
terraform init -reconfigure

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/google from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Reusing previous version of hashicorp/external from the dependency lock file
- Reusing previous version of hashicorp/null from the dependency lock file
- Using previously-installed hashicorp/aws v5.11.0
- Using previously-installed hashicorp/external v2.2.0
- Using previously-installed hashicorp/null v3.2.0
- Using previously-installed hashicorp/google v4.58.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
/Library/Developer/CommandLineTools/usr/bin/make check_providers_clean
git diff --exit-code --name-only .terraform.lock.hcl \
	&& git diff --cached --exit-code --name-only .terraform.lock.hcl
python /Users/daniel/repo/azul2/scripts/terraform_schema.py check \
	|| (echo "Schema is stale. Run 'make update_schema' and commit." ; false)
2024-01-11 14:56:28,630    INFO MainThread azul.terraform: Running ['terraform', 'version', '-json']
2024-01-11 14:56:28,703    INFO MainThread azul.terraform: Terraform output:
{
  "terraform_version": "1.6.5",
  "platform": "darwin_amd64",
  "provider_selections": {
    "registry.terraform.io/hashicorp/aws": "5.11.0",
    "registry.terraform.io/hashicorp/external": "2.2.0",
    "registry.terraform.io/hashicorp/google": "4.58.0",
    "registry.terraform.io/hashicorp/null": "3.2.0"
  },
  "terraform_outdated": true
}

python api_gateway.tf.json.template.py api_gateway.tf.json
Creating api_gateway.tf.json
python authentication.tf.json.template.py authentication.tf.json
Creating authentication.tf.json
python cloudwatch.tf.json.template.py cloudwatch.tf.json
Creating cloudwatch.tf.json
python common.tf.json.template.py common.tf.json
Creating common.tf.json
python dynamo.tf.json.template.py dynamo.tf.json
Creating dynamo.tf.json
python elasticsearch.tf.json.template.py elasticsearch.tf.json
python lambda_layer.tf.json.template.py lambda_layer.tf.json
Creating lambda_layer.tf.json
python s3.tf.json.template.py s3.tf.json
Creating s3.tf.json
python sqs.tf.json.template.py sqs.tf.json
Creating sqs.tf.json
python step_function.tf.json.template.py step_function.tf.json
[INFO]	2024-01-11T14:56:44.365Z	00010ca1-b0ba-466f-8c58-dabbad000000	botocore.credentials	Found credentials in shared credentials file: ~/.aws/credentials
Creating step_function.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul2/scripts/rename_resources.py
2024-01-11 14:56:50,585    INFO MainThread __main__: No renamings defined
# For private API we need the VPC endpoints to be created first so that the
# aws_lb_target_group_attachment can iterate over the network_interface_ids.
terraform apply -target aws_vpc_endpoint.indexer -target aws_vpc_endpoint.service
data.aws_subnet.gitlab_private_1: Reading...
data.aws_subnet.gitlab_private_0: Reading...
data.aws_vpc.gitlab: Reading...
data.aws_subnet.gitlab_private_1: Read complete after 0s [id=subnet-03e66f953199f819b]
data.aws_subnet.gitlab_private_0: Read complete after 1s [id=subnet-090846270b8070f28]
data.aws_vpc.gitlab: Read complete after 1s [id=vpc-03aeb4a3542c7a5d3]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.indexer_vpce will be created
  + resource "aws_security_group" "indexer_vpce" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.71.0.0/16",
                ]
              + description      = "Any traffic to the VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.71.0.0/16",
                ]
              + description      = "Any traffic from the VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "azul-indexer-daniel2_vpce"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "azul-indexer_vpce-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_vpce"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all               = {
          + "Name"       = "azul-indexer_vpce-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_vpce"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + vpc_id                 = "vpc-03aeb4a3542c7a5d3"
    }

  # aws_security_group.service_vpce will be created
  + resource "aws_security_group" "service_vpce" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.71.0.0/16",
                ]
              + description      = "Any traffic to the VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.71.0.0/16",
                ]
              + description      = "Any traffic from the VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "azul-service-daniel2_vpce"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "azul-service_vpce-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service_vpce"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all               = {
          + "Name"       = "azul-service_vpce-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service_vpce"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + vpc_id                 = "vpc-03aeb4a3542c7a5d3"
    }

  # aws_vpc_endpoint.indexer will be created
  + resource "aws_vpc_endpoint" "indexer" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.execute-api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-03e66f953199f819b",
          + "subnet-090846270b8070f28",
        ]
      + tags                  = {
          + "Name"       = "azul-indexer-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all              = {
          + "Name"       = "azul-indexer-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03aeb4a3542c7a5d3"
    }

  # aws_vpc_endpoint.service will be created
  + resource "aws_vpc_endpoint" "service" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.execute-api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-03e66f953199f819b",
          + "subnet-090846270b8070f28",
        ]
      + tags                  = {
          + "Name"       = "azul-service-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all              = {
          + "Name"       = "azul-service-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-03aeb4a3542c7a5d3"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warnings:

- Resource targeting is in effect

To see the full warning notes, run Terraform without -compact-warnings.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_security_group.service_vpce: Creating...
aws_security_group.indexer_vpce: Creating...
aws_security_group.service_vpce: Creation complete after 3s [id=sg-0ea4efd166b3ddeb7]
aws_security_group.indexer_vpce: Creation complete after 3s [id=sg-0c5596ac6300055ef]
aws_vpc_endpoint.service: Creating...
aws_vpc_endpoint.indexer: Creating...
aws_vpc_endpoint.service: Still creating... [10s elapsed]
aws_vpc_endpoint.indexer: Still creating... [10s elapsed]
aws_vpc_endpoint.service: Still creating... [20s elapsed]
aws_vpc_endpoint.indexer: Still creating... [20s elapsed]
aws_vpc_endpoint.indexer: Creation complete after 22s [id=vpce-0d38968b087e5e0fc]
aws_vpc_endpoint.service: Still creating... [30s elapsed]
aws_vpc_endpoint.service: Creation complete after 32s [id=vpce-0212658c2f5bd0608]

Warnings:

- Applied changes may be incomplete

To see the full warning notes, run Terraform without -compact-warnings.

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
terraform apply
data.external.elasticsearch_nodes: Reading...
null_resource.hmac_secret: Refreshing state... [id=5577006791947779410]
data.google_client_config.current: Reading...
google_project_iam_custom_role.azul: Refreshing state... [id=projects/platform-hca-dev/roles/azul_daniel2_5]
data.google_client_config.current: Read complete after 0s [id=projects/platform-hca-dev/regions//zones/]
google_service_account.azul_unregistered: Refreshing state... [id=projects/platform-hca-dev/serviceAccounts/azul-ucsc-5-unreg-daniel2@platform-hca-dev.iam.gserviceaccount.com]
google_service_account.azul: Refreshing state... [id=projects/platform-hca-dev/serviceAccounts/azul-ucsc-5-daniel2@platform-hca-dev.iam.gserviceaccount.com]
google_service_account.azul_public: Refreshing state... [id=projects/platform-hca-dev/serviceAccounts/azul-ucsc-5-public-daniel2@platform-hca-dev.iam.gserviceaccount.com]
aws_acm_certificate.service_1: Refreshing state... [id=arn:aws:acm:us-east-1:122796619775:certificate/8a3d846d-fa65-49b6-b488-58eb371b7a8d]
aws_acm_certificate.indexer_0: Refreshing state... [id=arn:aws:acm:us-east-1:122796619775:certificate/69a19ea9-6046-460d-be0b-15773589ef1a]
aws_acm_certificate.service_0: Refreshing state... [id=arn:aws:acm:us-east-1:122796619775:certificate/96d84ec6-b835-49e9-8d49-7c1e1c7884eb]
data.aws_partition.service: Reading...
data.aws_caller_identity.indexer: Reading...
aws_cloudwatch_log_group.indexer: Refreshing state... [id=/aws/apigateway/azul-indexer-daniel2]
aws_cloudwatch_log_group.waf_api_gateway: Refreshing state... [id=aws-waf-logs-azul-api_gateway-daniel2]
data.aws_partition.service: Read complete after 0s [id=aws]
aws_iam_role.service: Refreshing state... [id=azul-service-daniel2]
data.aws_caller_identity.service: Reading...
data.aws_s3_bucket.logs: Reading...
data.aws_caller_identity.service: Read complete after 1s [id=122796619775]
data.aws_caller_identity.indexer: Read complete after 1s [id=122796619775]
data.aws_partition.indexer: Reading...
data.aws_partition.indexer: Read complete after 0s [id=aws]
aws_sqs_queue.tallies_fail: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-tallies_fail-daniel2.fifo]
aws_cloudwatch_event_rule.indexer_indexercachehealth: Refreshing state... [id=azul-indexercachehealth-daniel2]
data.aws_wafv2_ip_set.blocked: Reading...
data.aws_route53_zone.dev_singlecell_gi_ucsc_edu: Reading...
data.aws_region.indexer: Reading...
data.aws_region.indexer: Read complete after 0s [id=us-east-1]
data.aws_subnet.gitlab_private_0: Reading...
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.object_versions: Refreshing state... [id=azul-object_versions-daniel2]
aws_s3_bucket.storage: Refreshing state... [id=edu-ucsc-gi-platform-hca-dev-storage-daniel2.us-east-1]
data.aws_vpc.gitlab: Reading...
data.aws_s3_bucket.logs: Read complete after 0s [id=edu-ucsc-gi-platform-hca-dev-logs.us-east-1]
aws_cloudwatch_log_group.service: Refreshing state... [id=/aws/apigateway/azul-service-daniel2]
aws_iam_role.indexer: Refreshing state... [id=azul-indexer-daniel2]
data.aws_wafv2_ip_set.blocked: Read complete after 0s [id=435000ed-dc3f-4379-8411-f4c436ab49b2]
aws_iam_role.states: Refreshing state... [id=azul-statemachine-daniel2]
data.aws_region.service: Reading...
data.aws_region.service: Read complete after 0s [id=us-east-1]
aws_sqs_queue.notifications_fail: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-notifications_fail-daniel2]
aws_cloudwatch_event_rule.service_servicecachehealth: Refreshing state... [id=azul-servicecachehealth-daniel2]
data.aws_subnet.gitlab_private_0: Read complete after 1s [id=subnet-090846270b8070f28]
data.aws_subnet.gitlab_private_1: Reading...
data.aws_subnet.gitlab_public_1: Reading...
data.external.elasticsearch_nodes: Read complete after 3s [id=-]
aws_dynamodb_table.sources_cache_by_auth: Refreshing state... [id=azul-sources_cache_by_auth-daniel2]
aws_kms_key.manifest: Refreshing state... [id=e4b6ff37-137c-4e1c-94a3-fc438168839d]
data.aws_subnet.gitlab_private_1: Read complete after 0s [id=subnet-03e66f953199f819b]
data.aws_caller_identity.current: Reading...
aws_lambda_layer_version.dependencies: Refreshing state... [id=arn:aws:lambda:us-east-1:122796619775:layer:azul-dependencies-daniel2:16]
data.aws_caller_identity.current: Read complete after 0s [id=122796619775]
data.aws_subnet.gitlab_public_0: Reading...
data.aws_subnet.gitlab_public_1: Read complete after 0s [id=subnet-06a1e10523948ab2a]
google_project_iam_member.azul: Refreshing state... [id=platform-hca-dev/projects/platform-hca-dev/roles/azul_daniel2_5/serviceAccount:azul-ucsc-5-daniel2@platform-hca-dev.iam.gserviceaccount.com]
data.aws_route53_zone.dev_singlecell_gi_ucsc_edu: Read complete after 1s [id=ZRJRXAKW4OYOA]
aws_sqs_queue.tallies_retry: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-tallies_retry-daniel2.fifo]
data.aws_subnet.gitlab_public_0: Read complete after 0s [id=subnet-091cfeb398baf4582]
aws_sqs_queue.notifications_retry: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-notifications_retry-daniel2]
aws_route53_record.indexer_domain_validation_0: Refreshing state... [id=ZRJRXAKW4OYOA__31f14a505e7f5aff96e1337193e75aef.indexer.daniel2.dev.singlecell.gi.ucsc.edu._CNAME]
aws_route53_record.service_domain_validation_0: Refreshing state... [id=ZRJRXAKW4OYOA__47b7f7faab8f1bcd9dda3a68b59636ac.service.daniel2.dev.singlecell.gi.ucsc.edu._CNAME]
aws_route53_record.service_domain_validation_1: Refreshing state... [id=ZRJRXAKW4OYOA__329a20bb915351447e02288615d3aba8.drs.daniel2.dev.singlecell.gi.ucsc.edu._CNAME]
aws_iam_role_policy.indexer: Refreshing state... [id=azul-indexer-daniel2:indexer]
aws_sfn_state_machine.manifest: Refreshing state... [id=arn:aws:states:us-east-1:122796619775:stateMachine:azul-manifest-daniel2]
data.aws_vpc.gitlab: Read complete after 1s [id=vpc-03aeb4a3542c7a5d3]
aws_iam_role_policy.states: Refreshing state... [id=azul-statemachine-daniel2:azul-statemachine-daniel2]
aws_cloudwatch_dashboard.dashboard: Refreshing state... [id=azul-dashboard-daniel2]
aws_sqs_queue.tallies: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-tallies-daniel2.fifo]
aws_security_group.service: Refreshing state... [id=sg-01a68de9b96a0df80]
aws_security_group.service_vpce: Refreshing state... [id=sg-0ea4efd166b3ddeb7]
aws_wafv2_web_acl.api_gateway: Refreshing state... [id=75eb688c-d7b5-4424-b234-6f4f9754b0be]
aws_security_group.indexer_vpce: Refreshing state... [id=sg-0c5596ac6300055ef]
aws_security_group.indexer: Refreshing state... [id=sg-0fc63905f12037336]
aws_kms_alias.manifest: Refreshing state... [id=alias/azul-manifest-daniel2]
aws_iam_role_policy.service: Refreshing state... [id=azul-service-daniel2:service]
aws_sqs_queue.notifications: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/122796619775/azul-notifications-daniel2]
aws_lambda_function.service: Refreshing state... [id=azul-service-daniel2]
aws_lambda_function.service_servicecachehealth: Refreshing state... [id=azul-service-daniel2-servicecachehealth]
aws_lambda_function.service_manifest: Refreshing state... [id=azul-service-daniel2-manifest]
aws_vpc_endpoint.service: Refreshing state... [id=vpce-0212658c2f5bd0608]
aws_acm_certificate_validation.indexer_0: Refreshing state... [id=2024-01-10 23:41:11.425 +0000 UTC]
aws_acm_certificate_validation.service_0: Refreshing state... [id=2024-01-10 23:41:13.404 +0000 UTC]
aws_vpc_endpoint.indexer: Refreshing state... [id=vpce-0d38968b087e5e0fc]
aws_lambda_function.indexer_aggregate_retry: Refreshing state... [id=azul-indexer-daniel2-aggregate_retry]
aws_lambda_function.indexer_contribute_retry: Refreshing state... [id=azul-indexer-daniel2-contribute_retry]
aws_lambda_function.indexer_contribute: Refreshing state... [id=azul-indexer-daniel2-contribute]
aws_lambda_function.indexer_indexercachehealth: Refreshing state... [id=azul-indexer-daniel2-indexercachehealth]
aws_lambda_function.indexer_aggregate: Refreshing state... [id=azul-indexer-daniel2-aggregate]
aws_lambda_function.indexer: Refreshing state... [id=azul-indexer-daniel2]
aws_s3_bucket_inventory.storage: Refreshing state... [id=edu-ucsc-gi-platform-hca-dev-storage-daniel2.us-east-1:azul-inventory-daniel2]
aws_s3_bucket_logging.storage: Refreshing state... [id=edu-ucsc-gi-platform-hca-dev-storage-daniel2.us-east-1]
aws_s3_bucket_lifecycle_configuration.storage: Refreshing state... [id=edu-ucsc-gi-platform-hca-dev-storage-daniel2.us-east-1]
aws_s3_bucket_public_access_block.storage: Refreshing state... [id=edu-ucsc-gi-platform-hca-dev-storage-daniel2.us-east-1]
aws_acm_certificate_validation.service_1: Refreshing state... [id=2024-01-10 23:41:10.953 +0000 UTC]
aws_api_gateway_domain_name.indexer_0: Refreshing state... [id=indexer.daniel2.dev.singlecell.gi.ucsc.edu]
aws_api_gateway_domain_name.service_0: Refreshing state... [id=service.daniel2.dev.singlecell.gi.ucsc.edu]
aws_lambda_event_source_mapping.indexer_aggregate_retry: Refreshing state... [id=54d2381a-7d5b-4e0c-8429-3b422f43482c]
data.aws_network_interface.service["eni-0ffe64a2ecfbcebaa"]: Reading...
data.aws_network_interface.service["eni-0e8c27a2ad3d01e61"]: Reading...
aws_lambda_event_source_mapping.indexer_contribute_retry: Refreshing state... [id=9ae54053-ada9-4559-b256-9689ba1ed9e1]
aws_lambda_function_event_invoke_config.service_servicecachehealth: Refreshing state... [id=azul-service-daniel2-servicecachehealth]
data.aws_network_interface.service["eni-0ffe64a2ecfbcebaa"]: Read complete after 1s [id=eni-0ffe64a2ecfbcebaa]
aws_lambda_permission.service_servicecachehealth: Refreshing state... [id=terraform-20240110234145714300000005]
aws_cloudwatch_event_target.service_servicecachehealth: Refreshing state... [id=azul-servicecachehealth-daniel2-azul-servicecachehealth-daniel2]
aws_lambda_event_source_mapping.indexer_contribute: Refreshing state... [id=a7944b71-3d9e-4cc7-b3aa-93b607d4dcff]
aws_lambda_permission.indexer_indexercachehealth: Refreshing state... [id=terraform-20240110234744030600000008]
aws_lambda_function_event_invoke_config.indexer_indexercachehealth: Refreshing state... [id=azul-indexer-daniel2-indexercachehealth]
aws_cloudwatch_event_target.indexer_indexercachehealth: Refreshing state... [id=azul-indexercachehealth-daniel2-azul-indexercachehealth-daniel2]
data.aws_network_interface.indexer["eni-007960dd75b06ff5b"]: Reading...
data.aws_network_interface.service["eni-0e8c27a2ad3d01e61"]: Read complete after 1s [id=eni-0e8c27a2ad3d01e61]
data.aws_network_interface.indexer["eni-0325ae8c6b90ebe5f"]: Reading...
aws_api_gateway_rest_api.service: Refreshing state... [id=dysqivz9kb]
aws_api_gateway_domain_name.service_1: Refreshing state... [id=drs.daniel2.dev.singlecell.gi.ucsc.edu]
aws_route53_record.service_0: Refreshing state... [id=ZRJRXAKW4OYOA_service.daniel2.dev.singlecell.gi.ucsc.edu_A]
aws_route53_record.indexer_0: Refreshing state... [id=ZRJRXAKW4OYOA_indexer.daniel2.dev.singlecell.gi.ucsc.edu_A]
aws_lambda_event_source_mapping.indexer_aggregate: Refreshing state... [id=0ddf8512-4da1-4c2e-b55b-f8b8a9673cc1]
data.aws_network_interface.indexer["eni-0325ae8c6b90ebe5f"]: Read complete after 0s [id=eni-0325ae8c6b90ebe5f]
data.aws_network_interface.indexer["eni-007960dd75b06ff5b"]: Read complete after 0s [id=eni-007960dd75b06ff5b]
aws_api_gateway_rest_api.indexer: Refreshing state... [id=h6bgyhna74]
aws_route53_record.service_1: Refreshing state... [id=ZRJRXAKW4OYOA_drs.daniel2.dev.singlecell.gi.ucsc.edu_A]
aws_api_gateway_deployment.service: Refreshing state... [id=b0vqes]
aws_lambda_permission.service: Refreshing state... [id=terraform-20240111223910253500000002]
aws_lambda_permission.indexer: Refreshing state... [id=terraform-20240111223909407100000001]
aws_api_gateway_deployment.indexer: Refreshing state... [id=a4p3ed]
aws_api_gateway_stage.service: Refreshing state... [id=ags-dysqivz9kb-daniel2]
aws_api_gateway_stage.indexer: Refreshing state... [id=ags-h6bgyhna74-daniel2]
aws_api_gateway_base_path_mapping.service_0: Refreshing state... [id=service.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_api_gateway_base_path_mapping.service_1: Refreshing state... [id=drs.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_api_gateway_method_settings.service_1: Refreshing state... [id=dysqivz9kb-daniel2-*/*]
aws_api_gateway_method_settings.service_0: Refreshing state... [id=dysqivz9kb-daniel2-*/*]
aws_api_gateway_base_path_mapping.indexer_0: Refreshing state... [id=indexer.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_api_gateway_method_settings.indexer_0: Refreshing state... [id=h6bgyhna74-daniel2-*/*]
aws_wafv2_web_acl_association.service: Refreshing state... [id=arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be,arn:aws:apigateway:us-east-1::/restapis/dysqivz9kb/stages/daniel2]
aws_wafv2_web_acl_association.indexer: Refreshing state... [id=arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be,arn:aws:apigateway:us-east-1::/restapis/h6bgyhna74/stages/daniel2]
aws_wafv2_web_acl_logging_configuration.waf_api_gateway: Refreshing state... [id=arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_base_path_mapping.indexer_0 will be replaced due to changes in replace_triggered_by
-/+ resource "aws_api_gateway_base_path_mapping" "indexer_0" {
      ~ id          = "indexer.daniel2.dev.singlecell.gi.ucsc.edu/" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_base_path_mapping.service_0 will be replaced due to changes in replace_triggered_by
-/+ resource "aws_api_gateway_base_path_mapping" "service_0" {
      ~ id          = "service.daniel2.dev.singlecell.gi.ucsc.edu/" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_base_path_mapping.service_1 will be replaced due to changes in replace_triggered_by
-/+ resource "aws_api_gateway_base_path_mapping" "service_1" {
      ~ id          = "drs.daniel2.dev.singlecell.gi.ucsc.edu/" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.indexer must be replaced
-/+ resource "aws_api_gateway_deployment" "indexer" {
      ~ created_date  = "2024-01-11T22:39:09Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:122796619775:h6bgyhna74/" -> (known after apply)
      ~ id            = "a4p3ed" -> (known after apply)
      ~ invoke_url    = "https://h6bgyhna74.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "35a4340a2ebb7296d531e63c2100e75c" -> "05a14743600c79b6fc64de6d86f6236d"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_deployment.service must be replaced
-/+ resource "aws_api_gateway_deployment" "service" {
      ~ created_date  = "2024-01-11T22:39:17Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:122796619775:dysqivz9kb/" -> (known after apply)
      ~ id            = "b0vqes" -> (known after apply)
      ~ invoke_url    = "https://dysqivz9kb.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "2a31c7be904b71adec5cfeb82af3b1c9" -> "41c3af60b4da939704d17a6409ebe286"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_method_settings.indexer_0 will be replaced due to changes in replace_triggered_by
-/+ resource "aws_api_gateway_method_settings" "indexer_0" {
      ~ id          = "h6bgyhna74-daniel2-*/*" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ settings {
          ~ cache_data_encrypted                       = false -> (known after apply)
          ~ cache_ttl_in_seconds                       = 300 -> (known after apply)
          ~ caching_enabled                            = false -> (known after apply)
          ~ require_authorization_for_cache_control    = true -> (known after apply)
          ~ unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # aws_api_gateway_method_settings.service_0 will be replaced due to changes in replace_triggered_by
-/+ resource "aws_api_gateway_method_settings" "service_0" {
      ~ id          = "dysqivz9kb-daniel2-*/*" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ settings {
          ~ cache_data_encrypted                       = false -> (known after apply)
          ~ cache_ttl_in_seconds                       = 300 -> (known after apply)
          ~ caching_enabled                            = false -> (known after apply)
          ~ require_authorization_for_cache_control    = true -> (known after apply)
          ~ unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # aws_api_gateway_method_settings.service_1 will be replaced due to changes in replace_triggered_by
-/+ resource "aws_api_gateway_method_settings" "service_1" {
      ~ id          = "dysqivz9kb-daniel2-*/*" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ settings {
          ~ cache_data_encrypted                       = false -> (known after apply)
          ~ cache_ttl_in_seconds                       = 300 -> (known after apply)
          ~ caching_enabled                            = false -> (known after apply)
          ~ require_authorization_for_cache_control    = true -> (known after apply)
          ~ unauthorized_cache_control_header_strategy = "SUCCEED_WITH_RESPONSE_HEADER" -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

  # aws_api_gateway_rest_api.indexer will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "indexer" {
      ~ body                         = jsonencode(
          ~ {
              + x-amazon-apigateway-endpoint-configuration = {
                  + vpcEndpointIds = [
                      + "vpce-0d38968b087e5e0fc",
                    ]
                }
              + x-amazon-apigateway-policy                 = {
                  + Statement = [
                      + {
                          + Action    = "execute-api:Invoke"
                          + Condition = {
                              + StringEquals = {
                                  + "aws:SourceVpce" = [
                                      + "vpce-0d38968b087e5e0fc",
                                    ]
                                }
                            }
                          + Effect    = "Allow"
                          + Principal = "*"
                          + Resource  = "arn:*:execute-api:*:*:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
                # (6 unchanged attributes hidden)
            }
        )
        id                           = "h6bgyhna74"
        name                         = "azul-indexer-daniel2"
      + policy                       = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "execute-api:Invoke"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceVpce" = [
                                  + "vpce-0d38968b087e5e0fc",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:*:execute-api:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
        tags                         = {
            "Name"       = "azul-indexer-daniel2"
            "billing"    = "hca"
            "component"  = "azul-indexer"
            "deployment" = "daniel2"
            "owner"      = "dsotirho@ucsc.edu"
            "service"    = "azul"
        }
        # (9 unchanged attributes hidden)

      ~ endpoint_configuration {
          ~ types            = [
              - "EDGE",
              + "PRIVATE",
            ]
          ~ vpc_endpoint_ids = [
              + "vpce-0d38968b087e5e0fc",
            ]
        }
    }

  # aws_api_gateway_rest_api.service will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "service" {
      ~ body                         = jsonencode(
          ~ {
              + x-amazon-apigateway-endpoint-configuration = {
                  + vpcEndpointIds = [
                      + "vpce-0212658c2f5bd0608",
                    ]
                }
              + x-amazon-apigateway-policy                 = {
                  + Statement = [
                      + {
                          + Action    = "execute-api:Invoke"
                          + Condition = {
                              + StringEquals = {
                                  + "aws:SourceVpce" = [
                                      + "vpce-0212658c2f5bd0608",
                                    ]
                                }
                            }
                          + Effect    = "Allow"
                          + Principal = "*"
                          + Resource  = "arn:*:execute-api:*:*:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
                # (6 unchanged attributes hidden)
            }
        )
        id                           = "dysqivz9kb"
        name                         = "azul-service-daniel2"
      + policy                       = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "execute-api:Invoke"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceVpce" = [
                                  + "vpce-0212658c2f5bd0608",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:*:execute-api:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
        tags                         = {
            "Name"       = "azul-service-daniel2"
            "billing"    = "hca"
            "component"  = "azul-service"
            "deployment" = "daniel2"
            "owner"      = "dsotirho@ucsc.edu"
            "service"    = "azul"
        }
        # (9 unchanged attributes hidden)

      ~ endpoint_configuration {
          ~ types            = [
              - "EDGE",
              + "PRIVATE",
            ]
          ~ vpc_endpoint_ids = [
              + "vpce-0212658c2f5bd0608",
            ]
        }
    }

  # aws_api_gateway_stage.indexer will be replaced due to changes in replace_triggered_by
-/+ resource "aws_api_gateway_stage" "indexer" {
      ~ arn                   = "arn:aws:apigateway:us-east-1::/restapis/h6bgyhna74/stages/daniel2" -> (known after apply)
      - cache_cluster_enabled = false -> null
      ~ deployment_id         = "a4p3ed" -> (known after apply)
      ~ execution_arn         = "arn:aws:execute-api:us-east-1:122796619775:h6bgyhna74/daniel2" -> (known after apply)
      ~ id                    = "ags-h6bgyhna74-daniel2" -> (known after apply)
      ~ invoke_url            = "https://h6bgyhna74.execute-api.us-east-1.amazonaws.com/daniel2" -> (known after apply)
        tags                  = {
            "Name"       = "azul-indexer-daniel2"
            "billing"    = "hca"
            "component"  = "azul-indexer"
            "deployment" = "daniel2"
            "owner"      = "dsotirho@ucsc.edu"
            "service"    = "azul"
        }
      - variables             = {} -> null
      ~ web_acl_arn           = "arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be" -> (known after apply)
      - xray_tracing_enabled  = false -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.service will be replaced due to changes in replace_triggered_by
-/+ resource "aws_api_gateway_stage" "service" {
      ~ arn                   = "arn:aws:apigateway:us-east-1::/restapis/dysqivz9kb/stages/daniel2" -> (known after apply)
      - cache_cluster_enabled = false -> null
      ~ deployment_id         = "b0vqes" -> (known after apply)
      ~ execution_arn         = "arn:aws:execute-api:us-east-1:122796619775:dysqivz9kb/daniel2" -> (known after apply)
      ~ id                    = "ags-dysqivz9kb-daniel2" -> (known after apply)
      ~ invoke_url            = "https://dysqivz9kb.execute-api.us-east-1.amazonaws.com/daniel2" -> (known after apply)
        tags                  = {
            "Name"       = "azul-service-daniel2"
            "billing"    = "hca"
            "component"  = "azul-service"
            "deployment" = "daniel2"
            "owner"      = "dsotirho@ucsc.edu"
            "service"    = "azul"
        }
      - variables             = {} -> null
      ~ web_acl_arn           = "arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be" -> (known after apply)
      - xray_tracing_enabled  = false -> null
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.indexer will be updated in-place
  ~ resource "aws_lambda_function" "indexer" {
        id                             = "azul-indexer-daniel2"
        tags                           = {
            "Name"        = "azul-indexer-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-indexer"
            "billing"     = "hca"
            "component"   = "azul-indexer"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_aggregate will be updated in-place
  ~ resource "aws_lambda_function" "indexer_aggregate" {
        id                             = "azul-indexer-daniel2-aggregate"
        tags                           = {
            "Name"        = "azul-indexer_aggregate-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-indexer"
            "billing"     = "hca"
            "component"   = "azul-indexer_aggregate"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_aggregate_retry will be updated in-place
  ~ resource "aws_lambda_function" "indexer_aggregate_retry" {
        id                             = "azul-indexer-daniel2-aggregate_retry"
        tags                           = {
            "Name"        = "azul-indexer_aggregate_retry-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-indexer"
            "billing"     = "hca"
            "component"   = "azul-indexer_aggregate_retry"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_contribute will be updated in-place
  ~ resource "aws_lambda_function" "indexer_contribute" {
        id                             = "azul-indexer-daniel2-contribute"
        tags                           = {
            "Name"        = "azul-indexer_contribute-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-indexer"
            "billing"     = "hca"
            "component"   = "azul-indexer_contribute"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_contribute_retry will be updated in-place
  ~ resource "aws_lambda_function" "indexer_contribute_retry" {
        id                             = "azul-indexer-daniel2-contribute_retry"
        tags                           = {
            "Name"        = "azul-indexer_contribute_retry-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-indexer"
            "billing"     = "hca"
            "component"   = "azul-indexer_contribute_retry"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.indexer_indexercachehealth will be updated in-place
  ~ resource "aws_lambda_function" "indexer_indexercachehealth" {
        id                             = "azul-indexer-daniel2-indexercachehealth"
        tags                           = {
            "Name"        = "azul-indexer_indexercachehealth-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-indexer"
            "billing"     = "hca"
            "component"   = "azul-indexer_indexercachehealth"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.service will be updated in-place
  ~ resource "aws_lambda_function" "service" {
        id                             = "azul-service-daniel2"
        tags                           = {
            "Name"        = "azul-service-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-service"
            "billing"     = "hca"
            "component"   = "azul-service"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.service_manifest will be updated in-place
  ~ resource "aws_lambda_function" "service_manifest" {
        id                             = "azul-service-daniel2-manifest"
        tags                           = {
            "Name"        = "azul-service_manifest-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-service"
            "billing"     = "hca"
            "component"   = "azul-service_manifest"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.service_servicecachehealth will be updated in-place
  ~ resource "aws_lambda_function" "service_servicecachehealth" {
        id                             = "azul-service-daniel2-servicecachehealth"
        tags                           = {
            "Name"        = "azul-service_servicecachehealth-daniel2"
            "aws-chalice" = "version=1.29.0:stage=daniel2:app=azul-service"
            "billing"     = "hca"
            "component"   = "azul-service_servicecachehealth"
            "deployment"  = "daniel2"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "AZUL_PRIVATE_API"                         = "0" -> "1"
                # (41 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb.indexer will be created
  + resource "aws_lb" "indexer" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = true
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "azul-indexer-daniel2"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-06a1e10523948ab2a",
          + "subnet-091cfeb398baf4582",
        ]
      + tags                                        = {
          + "Name"       = "azul-indexer-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                                    = {
          + "Name"       = "azul-indexer-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + access_logs {
          + bucket  = "edu-ucsc-gi-platform-hca-dev-logs.us-east-1"
          + enabled = true
          + prefix  = "alb/access/daniel2/indexer"
        }
    }

  # aws_lb.service will be created
  + resource "aws_lb" "service" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = true
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "azul-service-daniel2"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-06a1e10523948ab2a",
          + "subnet-091cfeb398baf4582",
        ]
      + tags                                        = {
          + "Name"       = "azul-service-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                                    = {
          + "Name"       = "azul-service-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)

      + access_logs {
          + bucket  = "edu-ucsc-gi-platform-hca-dev-logs.us-east-1"
          + enabled = true
          + prefix  = "alb/access/daniel2/service"
        }
    }

  # aws_lb_listener.indexer will be created
  + resource "aws_lb_listener" "indexer" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:122796619775:certificate/69a19ea9-6046-460d-be0b-15773589ef1a"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2019-08"
      + tags              = {
          + "Name"       = "azul-indexer-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_listener.service will be created
  + resource "aws_lb_listener" "service" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:122796619775:certificate/96d84ec6-b835-49e9-8d49-7c1e1c7884eb"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-FS-1-2-Res-2019-08"
      + tags              = {
          + "Name"       = "azul-service-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-service-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.indexer will be created
  + resource "aws_lb_target_group" "indexer" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "azul-indexer-daniel2"
      + port                               = 443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"       = "azul-indexer-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                           = {
          + "Name"       = "azul-indexer-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-03aeb4a3542c7a5d3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200,403"
          + path                = "/daniel2/version"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group.service will be created
  + resource "aws_lb_target_group" "service" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "azul-service-daniel2"
      + port                               = 443
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"       = "azul-service-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                           = {
          + "Name"       = "azul-service-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-03aeb4a3542c7a5d3"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 30
          + matcher             = "200,403"
          + path                = "/daniel2/version"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group_attachment.indexer["eni-007960dd75b06ff5b"] will be created
  + resource "aws_lb_target_group_attachment" "indexer" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = "172.71.2.151"
    }

  # aws_lb_target_group_attachment.indexer["eni-0325ae8c6b90ebe5f"] will be created
  + resource "aws_lb_target_group_attachment" "indexer" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = "172.71.0.103"
    }

  # aws_lb_target_group_attachment.service["eni-0e8c27a2ad3d01e61"] will be created
  + resource "aws_lb_target_group_attachment" "service" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = "172.71.0.59"
    }

  # aws_lb_target_group_attachment.service["eni-0ffe64a2ecfbcebaa"] will be created
  + resource "aws_lb_target_group_attachment" "service" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = "172.71.2.55"
    }

  # aws_route53_record.indexer_0 will be updated in-place
  ~ resource "aws_route53_record" "indexer_0" {
        id                               = "ZRJRXAKW4OYOA_indexer.daniel2.dev.singlecell.gi.ucsc.edu_A"
        name                             = "indexer.daniel2.dev.singlecell.gi.ucsc.edu"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ evaluate_target_health = true -> false
          ~ name                   = "d1dteadqaypb6e.cloudfront.net" -> (known after apply)
          ~ zone_id                = "Z2FDTNDATAQYW2" -> (known after apply)
        }
    }

  # aws_route53_record.service_0 will be updated in-place
  ~ resource "aws_route53_record" "service_0" {
        id                               = "ZRJRXAKW4OYOA_service.daniel2.dev.singlecell.gi.ucsc.edu_A"
        name                             = "service.daniel2.dev.singlecell.gi.ucsc.edu"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ evaluate_target_health = true -> false
          ~ name                   = "d2in947l5s1yxt.cloudfront.net" -> (known after apply)
          ~ zone_id                = "Z2FDTNDATAQYW2" -> (known after apply)
        }
    }

  # aws_route53_record.service_1 will be updated in-place
  ~ resource "aws_route53_record" "service_1" {
        id                               = "ZRJRXAKW4OYOA_drs.daniel2.dev.singlecell.gi.ucsc.edu_A"
        name                             = "drs.daniel2.dev.singlecell.gi.ucsc.edu"
        # (6 unchanged attributes hidden)

      ~ alias {
          ~ evaluate_target_health = true -> false
          ~ name                   = "d1xfkrb168uqul.cloudfront.net" -> (known after apply)
          ~ zone_id                = "Z2FDTNDATAQYW2" -> (known after apply)
        }
    }

  # aws_security_group.indexer_alb will be created
  + resource "aws_security_group" "indexer_alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.71.0.0/16",
                ]
              + description      = "Any traffic to the VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.71.0.0/16",
                ]
              + description      = "Any traffic from the VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "azul-indexer-daniel2_alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "azul-indexer_alb-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_alb"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all               = {
          + "Name"       = "azul-indexer_alb-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_alb"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + vpc_id                 = "vpc-03aeb4a3542c7a5d3"
    }

  # aws_security_group.service_alb will be created
  + resource "aws_security_group" "service_alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.71.0.0/16",
                ]
              + description      = "Any traffic to the VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.71.0.0/16",
                ]
              + description      = "Any traffic from the VPC"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "azul-service-daniel2_alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"       = "azul-service_alb-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service_alb"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all               = {
          + "Name"       = "azul-service_alb-daniel2"
          + "billing"    = "hca"
          + "component"  = "azul-service_alb"
          + "deployment" = "daniel2"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + vpc_id                 = "vpc-03aeb4a3542c7a5d3"
    }

  # aws_vpc_endpoint_policy.indexer will be created
  + resource "aws_vpc_endpoint_policy" "indexer" {
      + id              = (known after apply)
      + policy          = (known after apply)
      + vpc_endpoint_id = "vpce-0d38968b087e5e0fc"
    }

  # aws_vpc_endpoint_policy.service will be created
  + resource "aws_vpc_endpoint_policy" "service" {
      + id              = (known after apply)
      + policy          = (known after apply)
      + vpc_endpoint_id = "vpce-0212658c2f5bd0608"
    }

  # aws_wafv2_web_acl_association.indexer will be replaced due to changes in replace_triggered_by
-/+ resource "aws_wafv2_web_acl_association" "indexer" {
      ~ id           = "arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be,arn:aws:apigateway:us-east-1::/restapis/h6bgyhna74/stages/daniel2" -> (known after apply)
      ~ resource_arn = "arn:aws:apigateway:us-east-1::/restapis/h6bgyhna74/stages/daniel2" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_web_acl_association.service will be replaced due to changes in replace_triggered_by
-/+ resource "aws_wafv2_web_acl_association" "service" {
      ~ id           = "arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be,arn:aws:apigateway:us-east-1::/restapis/dysqivz9kb/stages/daniel2" -> (known after apply)
      ~ resource_arn = "arn:aws:apigateway:us-east-1::/restapis/dysqivz9kb/stages/daniel2" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 26 to add, 14 to change, 12 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_api_gateway_base_path_mapping.service_1: Destroying... [id=drs.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_api_gateway_base_path_mapping.service_0: Destroying... [id=service.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_wafv2_web_acl_association.service: Destroying... [id=arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be,arn:aws:apigateway:us-east-1::/restapis/dysqivz9kb/stages/daniel2]
aws_wafv2_web_acl_association.indexer: Destroying... [id=arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be,arn:aws:apigateway:us-east-1::/restapis/h6bgyhna74/stages/daniel2]
aws_api_gateway_base_path_mapping.indexer_0: Destroying... [id=indexer.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_api_gateway_method_settings.service_1: Destroying... [id=dysqivz9kb-daniel2-*/*]
aws_api_gateway_method_settings.indexer_0: Destroying... [id=h6bgyhna74-daniel2-*/*]
aws_lb_target_group.service: Creating...
aws_lambda_function.service_manifest: Modifying... [id=azul-service-daniel2-manifest]
aws_security_group.service_alb: Creating...
aws_api_gateway_base_path_mapping.service_0: Destruction complete after 0s
aws_api_gateway_method_settings.service_0: Destroying... [id=dysqivz9kb-daniel2-*/*]
aws_api_gateway_method_settings.service_1: Destruction complete after 0s
aws_api_gateway_method_settings.indexer_0: Destruction complete after 0s
aws_lb_target_group.indexer: Creating...
aws_lambda_function.service_servicecachehealth: Modifying... [id=azul-service-daniel2-servicecachehealth]
aws_wafv2_web_acl_association.service: Destruction complete after 0s
aws_lambda_function.indexer_contribute: Modifying... [id=azul-indexer-daniel2-contribute]
aws_wafv2_web_acl_association.indexer: Destruction complete after 0s
aws_api_gateway_method_settings.service_0: Destruction complete after 0s
aws_security_group.indexer_alb: Creating...
aws_api_gateway_base_path_mapping.service_1: Destruction complete after 0s
aws_lambda_function.indexer_indexercachehealth: Modifying... [id=azul-indexer-daniel2-indexercachehealth]
aws_lambda_function.indexer_contribute_retry: Modifying... [id=azul-indexer-daniel2-contribute_retry]
aws_api_gateway_base_path_mapping.indexer_0: Destruction complete after 1s
aws_lambda_function.indexer_aggregate: Modifying... [id=azul-indexer-daniel2-aggregate]
aws_lb_target_group.service: Creation complete after 2s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-service-daniel2/ce000a57dd70fca5]
aws_lambda_function.indexer_aggregate_retry: Modifying... [id=azul-indexer-daniel2-aggregate_retry]
aws_lb_target_group.indexer: Creation complete after 2s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-indexer-daniel2/3e4a4d33b6277d87]
aws_vpc_endpoint_policy.service: Creating...
aws_security_group.service_alb: Creation complete after 3s [id=sg-00921ad1a51389d94]
aws_api_gateway_stage.service: Destroying... [id=ags-dysqivz9kb-daniel2]
aws_security_group.indexer_alb: Creation complete after 3s [id=sg-0b137befd0385ff19]
aws_api_gateway_stage.indexer: Destroying... [id=ags-h6bgyhna74-daniel2]
aws_api_gateway_stage.indexer: Destruction complete after 1s
aws_vpc_endpoint_policy.indexer: Creating...
aws_api_gateway_stage.service: Destruction complete after 1s
aws_api_gateway_deployment.indexer: Destroying... [id=a4p3ed]
aws_api_gateway_deployment.indexer: Destruction complete after 0s
aws_lb_target_group_attachment.service["eni-0e8c27a2ad3d01e61"]: Creating...
aws_lb_target_group_attachment.service["eni-0e8c27a2ad3d01e61"]: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-service-daniel2/ce000a57dd70fca5-20240111225820295200000001]
aws_lb_target_group_attachment.service["eni-0ffe64a2ecfbcebaa"]: Creating...
aws_lb_target_group_attachment.service["eni-0ffe64a2ecfbcebaa"]: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-service-daniel2/ce000a57dd70fca5-20240111225820585100000002]
aws_lb_target_group_attachment.indexer["eni-007960dd75b06ff5b"]: Creating...
aws_lb_target_group_attachment.indexer["eni-007960dd75b06ff5b"]: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-indexer-daniel2/3e4a4d33b6277d87-20240111225820980700000003]
aws_lb_target_group_attachment.indexer["eni-0325ae8c6b90ebe5f"]: Creating...
aws_lb_target_group_attachment.indexer["eni-0325ae8c6b90ebe5f"]: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-indexer-daniel2/3e4a4d33b6277d87-20240111225821297800000004]
aws_api_gateway_deployment.service: Destroying... [id=b0vqes]
aws_lambda_function.service_manifest: Modifications complete after 6s [id=azul-service-daniel2-manifest]
aws_lb.service: Creating...
aws_lambda_function.service_servicecachehealth: Modifications complete after 6s [id=azul-service-daniel2-servicecachehealth]
aws_lb.indexer: Creating...
aws_lambda_function.indexer_contribute_retry: Modifications complete after 5s [id=azul-indexer-daniel2-contribute_retry]
aws_lambda_function.indexer_contribute: Modifications complete after 6s [id=azul-indexer-daniel2-contribute]
aws_lambda_function.indexer_indexercachehealth: Modifications complete after 5s [id=azul-indexer-daniel2-indexercachehealth]
aws_lambda_function.indexer: Modifying... [id=azul-indexer-daniel2]
aws_lambda_function.indexer_aggregate: Modifications complete after 6s [id=azul-indexer-daniel2-aggregate]
aws_api_gateway_deployment.service: Destruction complete after 2s
aws_lambda_function.service: Modifying... [id=azul-service-daniel2]
aws_lambda_function.indexer_aggregate_retry: Modifications complete after 6s [id=azul-indexer-daniel2-aggregate_retry]
aws_vpc_endpoint_policy.service: Creation complete after 6s [id=vpce-0212658c2f5bd0608]
aws_vpc_endpoint_policy.indexer: Creation complete after 6s [id=vpce-0d38968b087e5e0fc]
aws_lambda_function.indexer: Modifications complete after 6s [id=azul-indexer-daniel2]
aws_api_gateway_rest_api.indexer: Modifying... [id=h6bgyhna74]
aws_lambda_function.service: Modifications complete after 6s [id=azul-service-daniel2]
aws_api_gateway_rest_api.service: Modifying... [id=dysqivz9kb]
aws_lb.service: Still creating... [10s elapsed]
aws_lb.indexer: Still creating... [10s elapsed]
aws_api_gateway_rest_api.indexer: Modifications complete after 7s [id=h6bgyhna74]
aws_api_gateway_deployment.indexer: Creating...
aws_api_gateway_rest_api.service: Modifications complete after 6s [id=dysqivz9kb]
aws_api_gateway_deployment.service: Creating...
aws_api_gateway_deployment.indexer: Creation complete after 0s [id=u1riq3]
aws_api_gateway_stage.indexer: Creating...
aws_api_gateway_stage.indexer: Creation complete after 1s [id=ags-h6bgyhna74-daniel2]
aws_api_gateway_base_path_mapping.indexer_0: Creating...
aws_api_gateway_method_settings.indexer_0: Creating...
aws_wafv2_web_acl_association.indexer: Creating...
aws_api_gateway_base_path_mapping.indexer_0: Creation complete after 0s [id=indexer.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_api_gateway_method_settings.indexer_0: Creation complete after 0s [id=h6bgyhna74-daniel2-*/*]
aws_wafv2_web_acl_association.indexer: Creation complete after 3s [id=arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be,arn:aws:apigateway:us-east-1::/restapis/h6bgyhna74/stages/daniel2]
aws_api_gateway_deployment.service: Creation complete after 6s [id=w83ic0]
aws_api_gateway_stage.service: Creating...
aws_api_gateway_stage.service: Creation complete after 1s [id=ags-dysqivz9kb-daniel2]
aws_api_gateway_base_path_mapping.service_1: Creating...
aws_api_gateway_base_path_mapping.service_0: Creating...
aws_api_gateway_method_settings.service_1: Creating...
aws_api_gateway_method_settings.service_0: Creating...
aws_wafv2_web_acl_association.service: Creating...
aws_lb.service: Still creating... [20s elapsed]
aws_lb.indexer: Still creating... [20s elapsed]
aws_api_gateway_method_settings.service_0: Creation complete after 0s [id=dysqivz9kb-daniel2-*/*]
aws_api_gateway_base_path_mapping.service_0: Creation complete after 0s [id=service.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_api_gateway_method_settings.service_1: Creation complete after 0s [id=dysqivz9kb-daniel2-*/*]
aws_api_gateway_base_path_mapping.service_1: Creation complete after 0s [id=drs.daniel2.dev.singlecell.gi.ucsc.edu/]
aws_wafv2_web_acl_association.service: Creation complete after 4s [id=arn:aws:wafv2:us-east-1:122796619775:regional/webacl/azul-api_gateway-daniel2/75eb688c-d7b5-4424-b234-6f4f9754b0be,arn:aws:apigateway:us-east-1::/restapis/dysqivz9kb/stages/daniel2]
aws_lb.service: Still creating... [30s elapsed]
aws_lb.indexer: Still creating... [30s elapsed]
aws_lb.service: Still creating... [40s elapsed]
aws_lb.indexer: Still creating... [40s elapsed]
aws_lb.service: Still creating... [50s elapsed]
aws_lb.indexer: Still creating... [50s elapsed]
aws_lb.service: Still creating... [1m0s elapsed]
aws_lb.indexer: Still creating... [1m0s elapsed]
aws_lb.service: Still creating... [1m10s elapsed]
aws_lb.indexer: Still creating... [1m10s elapsed]
aws_lb.service: Still creating... [1m20s elapsed]
aws_lb.indexer: Still creating... [1m20s elapsed]
aws_lb.service: Still creating... [1m30s elapsed]
aws_lb.indexer: Still creating... [1m30s elapsed]
aws_lb.service: Still creating... [1m40s elapsed]
aws_lb.indexer: Still creating... [1m40s elapsed]
aws_lb.service: Still creating... [1m50s elapsed]
aws_lb.indexer: Still creating... [1m50s elapsed]
aws_lb.service: Still creating... [2m0s elapsed]
aws_lb.indexer: Still creating... [2m0s elapsed]
aws_lb.service: Still creating... [2m10s elapsed]
aws_lb.indexer: Still creating... [2m10s elapsed]
aws_lb.service: Still creating... [2m20s elapsed]
aws_lb.indexer: Still creating... [2m20s elapsed]
aws_lb.service: Still creating... [2m30s elapsed]
aws_lb.indexer: Still creating... [2m30s elapsed]
aws_lb.service: Still creating... [2m40s elapsed]
aws_lb.indexer: Still creating... [2m40s elapsed]
aws_lb.service: Still creating... [2m50s elapsed]
aws_lb.indexer: Still creating... [2m50s elapsed]
aws_lb.service: Creation complete after 2m54s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:loadbalancer/app/azul-service-daniel2/0d8daa69ccc0cff3]
aws_route53_record.service_0: Modifying... [id=ZRJRXAKW4OYOA_service.daniel2.dev.singlecell.gi.ucsc.edu_A]
aws_route53_record.service_1: Modifying... [id=ZRJRXAKW4OYOA_drs.daniel2.dev.singlecell.gi.ucsc.edu_A]
aws_lb_listener.service: Creating...
aws_lb_listener.service: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:listener/app/azul-service-daniel2/0d8daa69ccc0cff3/5c4002fd2310db60]
aws_lb.indexer: Still creating... [3m0s elapsed]
aws_lb.indexer: Creation complete after 3m4s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:loadbalancer/app/azul-indexer-daniel2/ec2cd277a612b4cf]
aws_route53_record.indexer_0: Modifying... [id=ZRJRXAKW4OYOA_indexer.daniel2.dev.singlecell.gi.ucsc.edu_A]
aws_lb_listener.indexer: Creating...
aws_lb_listener.indexer: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:listener/app/azul-indexer-daniel2/ec2cd277a612b4cf/68983f0aae9f7f1c]
aws_route53_record.service_1: Still modifying... [id=ZRJRXAKW4OYOA_drs.daniel2.dev.singlecell.gi.ucsc.edu_A, 10s elapsed]
aws_route53_record.service_0: Still modifying... [id=ZRJRXAKW4OYOA_service.daniel2.dev.singlecell.gi.ucsc.edu_A, 10s elapsed]
aws_route53_record.indexer_0: Still modifying... [id=ZRJRXAKW4OYOA_indexer.daniel2.dev.singlecell.gi.ucsc.edu_A, 10s elapsed]
aws_route53_record.service_0: Still modifying... [id=ZRJRXAKW4OYOA_service.daniel2.dev.singlecell.gi.ucsc.edu_A, 20s elapsed]
aws_route53_record.service_1: Still modifying... [id=ZRJRXAKW4OYOA_drs.daniel2.dev.singlecell.gi.ucsc.edu_A, 20s elapsed]
aws_route53_record.indexer_0: Still modifying... [id=ZRJRXAKW4OYOA_indexer.daniel2.dev.singlecell.gi.ucsc.edu_A, 20s elapsed]
aws_route53_record.service_1: Still modifying... [id=ZRJRXAKW4OYOA_drs.daniel2.dev.singlecell.gi.ucsc.edu_A, 30s elapsed]
aws_route53_record.service_0: Still modifying... [id=ZRJRXAKW4OYOA_service.daniel2.dev.singlecell.gi.ucsc.edu_A, 30s elapsed]
aws_route53_record.indexer_0: Still modifying... [id=ZRJRXAKW4OYOA_indexer.daniel2.dev.singlecell.gi.ucsc.edu_A, 30s elapsed]
aws_route53_record.service_1: Still modifying... [id=ZRJRXAKW4OYOA_drs.daniel2.dev.singlecell.gi.ucsc.edu_A, 40s elapsed]
aws_route53_record.service_0: Still modifying... [id=ZRJRXAKW4OYOA_service.daniel2.dev.singlecell.gi.ucsc.edu_A, 40s elapsed]
aws_route53_record.service_1: Modifications complete after 42s [id=ZRJRXAKW4OYOA_drs.daniel2.dev.singlecell.gi.ucsc.edu_A]
aws_route53_record.indexer_0: Still modifying... [id=ZRJRXAKW4OYOA_indexer.daniel2.dev.singlecell.gi.ucsc.edu_A, 40s elapsed]
aws_route53_record.service_0: Modifications complete after 49s [id=ZRJRXAKW4OYOA_service.daniel2.dev.singlecell.gi.ucsc.edu_A]
aws_route53_record.indexer_0: Modifications complete after 48s [id=ZRJRXAKW4OYOA_indexer.daniel2.dev.singlecell.gi.ucsc.edu_A]

Apply complete! Resources: 26 added, 14 changed, 12 destroyed.
```

</details>